{
  "Alfalfa, Dormant": {
    "Topic Details": "Perennial. Not commonly used as a cover crop. Needs high soil pH, good fertility; not for wet soils. Good drought tolerance once established. Excellent legume hay crop, very deep taproot, excellent N fixer. Best for multi-year growth (2 to 6 summers) and double-duty as forage and soil builder. Cut for hay or clip occasionally to keep vegetative and maintain stand. For hay, 1st cut at bud stage, next cuts every 30-40 days (late bud to ¼ bloom), last cut in fall in time for 8” regrowth. Dormant in winter; mix with cool-season perennial grass (e.g., orchardgrass) or overseed with annual grass (e.g, wheat) for winter cover and to moderate C:N ratio at termination. Consider seeding with a nurse crop such as spring oats at low rate or small grains that will be harvested/mowed off to release perennial understory. Inoculate seed with the appropriate Rhizobium spp.; cross-inoculates with sweetclover."
  },
  "Barley, Winter": {
    "Topic Details": "Upright small grain. Widely used in the Northeast. Best small grain for drought, heat, salty or alkaline soils. Not for wet or acid soils. Winter barley typically needs vernalization (overwintering) to produce stalk/head/seed. May stay short and fail to flower if planted in spring. Quick growth and high biomass if fertility is good. Good weed suppressor, N scavenger, forage producer. Retains feed quality after heading. Good nurse crop for legumes. Use care when including as a cover crop in a small grain rotation (host for same diseases and pests). Bloom timing and height match crimson clover, rapeseed when used in a mix. Planted earlier in fall, matures earlier in spring than wheat. More winter-hardy than oat, less than wheat/rye. Better fall growth and tillers more than wheat/rye but more prone to frost damage."
  },
  "Buckwheat": {
    "Topic Details": "Low-growing summer annual. Popular summer cover crop. Needs warm conditions, but very low tolerance to drought or high heat. Fine root system good for topsoil conditioning, but not subsoiling. Purported to be good for unlocking soil phosphorus (P). Excellent weed suppressor due to very fast growth (not allelopathy). Blooms and extrafloral nectaries excellent for pollinators and other beneficial organisms. High risk of reseeding: kill or mow within 7-10 days after first bloom. Sets seed faster than all other covers – if reseeding is a concern, don’t grow in mixes. Easy to kill."
  },
  "Cereal Rye, Spring": {
    "Topic Details": "Best choice for poor/acid soils. Tolerates wet soil. Spring cereal rye germplasm does not require vernalization (overwintering) to flower and may be less winter-hardy than winter cereal rye if planted in the fall. Good cover crop for many purposes: excellent for biomass, N scavenging, weed control. Good forage, but low quality after heading. Best choice for roller-crimping. Height, biomass, high C:N ratio at maturity can be overwhelming and may hinder a following cash crop. Potential weed if it sets seed, especially in small grain cash crops. Mix with vetch, pea."
  },
  "Cereal Rye, Winter": {
    "Topic Details": "Most commonly-grown cover crop in the US. Most winter-hardy cover crop, best choice for poor/acid soils. Tolerates wet soil. Winter cereal rye requires vernalization (overwintering) to flower and will likely fail to flower if planted in spring; good or bad depending on purpose. Best winter cover for many purposes: excellent for biomass, N scavenging, weed control. Good forage, but low quality after heading. Best choice for roller-crimping. Height, biomass, high C:N ratio at maturity can be overwhelming and may hinder a following cash crop. Potential weed if it sets seed, especially in small grain cash crops. Mix with vetch, pea. Can plant later than any small grain, but goes to head early in spring – only barley is earlier."
  },
  "Clover, Crimson": {
    "Topic Details": "Short, upright growth habit. Popular in warmer regions of the Northeast. Shade tolerant. Does not reliably overwinter. Good forage producer, good N-fixer. Showy red blooms, good for pollinators. Can reseed quickly and become a weed. Host to some problem nematodes. Inoculate the seed with appropriate Rhizobium spp. Cross-inoculates with red or white clover. Mixes especially well with barley, annual ryegrass. Earlier-seeded, more fall growth, earlier spring bloom than hairy vetch. Slower residue breakdown and N release than vetch."
  },
  "Clover, Red": {
    "Topic Details": "Short-lived upright perennial, often lasts two years. Often grown for hay. Best on good soils with high fertility; tolerates some wetness. Establishes readily, shade tolerant, very winter-hardy, inexpensive. Resists some problem nematodes, good taproot. Moderate to xcellent N fixation depending on planting timing. Excellent forage, blooms for pollinators. For fall-seeding, use multi-cut medium or one-cut mammoth varieties. Multi-cut “medium” types best for spring planting. Keep hayed (¼-⅓ bloom) or clipped high to avoid seed set, keep stand vegetative. Mix with grasses like orchardgrass or fescue to moderate C:N ratio at termination. Consider seeding with spring oat nurse crop at low rate in fall or small grain that will be harvested/mowed to “release” clover understory. Inoculate with appropriate Rhizobium spp.; cross inoculates with crimson or white clover. Slower growing, must be seeded earlier and killed later than other fall-seeded legumes."
  },
  "Cowpea": {
    "Topic Details": "Excellent summer legume. Needs heat to grow well. Very heat and drought tolerant once established, deep taproot, tolerates low fertility. Some shade tolerance. Grows fast, good biomass and forage producer, high N fixation potential, good weed suppressor. Extrafloral nectaries key for beneficial insects. Some suppression for problem nematodes. Low reseeding and weed risk. Inoculate; cross-inoculates with peanut, sunn hemp. Many varieties available: use forage or cover crop cultivars, with bush types for short mixes, vine- or runner- types for tall mixes."
  },
  "Millet, Pearl": {
    "Topic Details": "Tall summer annual grass. Does best under hot conditions. Fast growing. Some contradictory info on regrowth potential, but generally expected to regrow well if mowed/grazed high. Improved forage types available, cultivars may vary widely. Mix with cowpea, sunhemp. Very similar to sorghum-sudangrass except slightly lower biomass potential; better on acid and droughty soils; less allelopathy potential; less reputation for subsoiling; no prussic acid forage toxicity (but nitrates still a concern)."
  },
  "Mustard": {
    "Topic Details": "“Mustard” encompasses several species including white/yellow mustard (Sinapis alba), Indian/brown mustard (Brassica juncea), and black mustard (Brassica nigra). Research & match varieties to your needs. Similar to other brassicas such as rapeseed/canola.Most commonly used for pest suppression and adding diversity to mixes. Contains the most bio-toxic compounds, best brassica for bio-fumigation (requires soil incorporation, etc.). With fertility, potential for fast fall growth, high biomass, good N scavenging. Not known for subsoiling, some varieties may not have taproot. Winter-hardiness, day-length response, other characteristics may vary by cultivar. If planted in the spring, may bolt (flower) before it can produce much biomass."
  },
  "Oats, Spring": {
    "Topic Details": "Least-hardy small grain; does not overwinter. Good weed suppressor, ok N scavenger, high forage quality. Needs good fertility for maximum benefits. Good nurse crop. Good rotation for other small grains – not a host for take-all disease. Select spring types that go to stalk/head/seed without vernalization. Mix with radish, peas. Compared to other small grains: lowest biomass, lower C:N, lower tolerance for dry/wet extremes."
  },
  "Oats, Winter": {
    "Topic Details": "Least-hardy small grain; does not overwinter. Good weed suppressor, ok N scavenger, high forage quality. Needs good fertility for maximum benefits. Good nurse crop. Good rotation for other small grains – not a host for take-all disease. Vernalization (overwintering) triggers heading unless germplasm is of the spring oat type. Mix with radish, peas. Planted early in fall, but last small grain to mature in spring. Compared to other small grains: lowest biomass, slightly lower C:N, lower tolerance for dry/wet extremes."
  },
  "Pea, Spring": {
    "Topic Details": "Also known as Yellow Pea or Canadian Spring Pea. Winter-kills if planted in fall. Excellent spring cover crop. Plant early for lush growth; fast-growing varieties are available. Inoculate the seed with appropriate Rhizobium spp. Cross inoculates vetch. Mixes well with spring oat, forage radish. Lower biomass and total N fixation compared to overwintered peas."
  },
  "Pea, Winter": {
    "Topic Details": "Also known as Austrian Winter Pea. Vining cool-season annual. Variable winter hardiness. Excellent N-fixer, good biomass and forage. Low risk of reseeding and becoming weed. Sclerotinia crown rot can take out whole fields, rotate with non-susceptible crops to reduce risk. Inoculate the seed with appropriate Rhizobium spp. Cross inoculates vetch. If the goal is winter-wintering, select cultivar accordingly, avoid planting too early or late and plant at the deeper end of the recommended planting depth range. May be planted in spring, but potentially slower growth and slightly lower biomass and N fixation than spring peas. Mixes well with oat and radish. Will climb small grain in mixes. Succulent residues disappear and release N faster than vetch."
  },
  "Radish, Forage": {
    "Topic Details": "Also known as Daikon or tillage or oilseed radish. Excellent fall-planted choice if winter-kill is desired. Fastest-growing fall cover crop option if good fertility is present. Top weed suppressor. Winter-killed residues disappear and release N rapidly (positive or negative depending on your goals and following cash crop). May overwinter in unusually warm winters in zone 7, or if snow cover is present to buffer temperature extremes. Plant early and plant at the low end of the recommended seeding rate for large, lush plants that are more likely to winter-kill. Plant late and plant at the high end of the recommended seeding rate for smaller plants that are more winter-hardy. Acts differently when planted in spring: much less root and top growth, bolts and flowers very quickly. Attractive white flowers. Thus, plant in spring primarily to add fast bloom, diversity to mixes. Some varieties may differ in sensitivity to daylength and thus may be slower to bolt in spring. Terminate prior to seed set to prevent it from becoming a weed. Good in mixes, especially with peas and oats, but plant at low end of the recommended seeding rate range to prevent it from out-competing companions. Plant in mix with a winter-hardy grass such as cereal rye if N leaching over winter/early spring is a concern. Some oilseed radish varieties have less vigorous top growth and thinner, often forked root, and slower to bolt in fall than other Daikon-type radishes.."
  },
  "Rapeseed": {
    "Topic Details": "Excellent fall-planted cover crop choice. Winter-hardy Brassica. Generally winter-hardy if seeded during the optimum planting window; cultivars vary in cold hardiness. With adequate residual soil fertility, provides good biomass, forage, deep branched taproot, N scavenging, weed suppression. Spring flowers attract pollinators. Low cost to seed. Range of cultivar choices (canola for seed, hybrids for grazing, etc.), characteristics may differ. Good in mixes, but plant at low end of seeding rate to prevent it from outcompeting other cover crops in the mix. Can be hard to kill in late spring with herbicides or tillage. “Dwarf Essex” is a commonly-grown cultivar."
  },
  "Ryegrass, Annual": {
    "Topic Details": "Also sometimes known as Italian ryegrass. Establishes well in tough conditions. Tolerates wet feet better than small grains. Not good in heat or drought. Winter-hardiness can vary – select cultivar accordingly. Dense fibrous root system, top soil conditioner, good weed fighter and N scavenger, top-quality forage. Needs N fertility for high biomass. Annual ryegrass is a key weed in small grains. Do not allow to set seed. Can be hard to kill with herbicides. Mixes well with crimson clover. Shorter than small grains with a lower C:N ratio."
  },
  "Sorghum": {
    "Topic Details": "Excellent summer grass choice. Needs heat. Fast-grower, big biomass potential in the presence of lots of soil N. Regrows well after mowing/grazing. Excellent subsoiler with thicker roots than most grasses. Excellent weed suppressor due to competition and allelopathy (caution if next crop is small-seeded). Good forage, but prussic acid and nitrate content can be a problem. Huge biomass and reseeding and weed potential can overwhelm: mow or kill in a timely fashion. Improved forage types available, cultivars may vary widely. Can substitute sorghum-sudangrass or sudangrass. Mix with cowpea, sunn hemp. Will died with first hard frost."
  },
  "Sorghum-sudangrass": {
    "Topic Details": "Also known as: Sudex, Sudax. Excellent summer grass choice. Needs heat. Fast-grower that reaches 6-12 ft tall, big biomass potential in the presence of lots of soil N. Regrows well after mowing/grazing. Excellent subsoiler with thicker roots than most grasses. Excellent weed suppressor due to competition and allelopathy (caution if next crop is small-seeded). Good forage, but prussic acid and nitrate content can be a problem. Huge biomass and reseeding and weed potential can overwhelm: mow or kill in a timely fashion. Improved forage types available, cultivars may vary widely. Can substitute forage sorghum or sudangrass. Mix with cowpea, sunn hemp."
  },
  "Soybeans": {
    "Topic Details": "Also known as forage soybean. Good N-fixation, biomass, and forage potential. Low reseeding and weed risk. Do not use in rotations where soybeans are grown as a cash crop. Inoculate. Many varieties are available; use late-maturing or forage cultivars for high biomass. Its bushy growth habit mixes better with short grasses like foxtail millet. Similar to cowpea for cover crop use. Compared to cowpea: more tolerant of cool weather, wet soils; less tolerant of drought, pests, poor soil fertility."
  },
  "Sunn Hemp": {
    "Topic Details": "Tall tropical legume. Needs heat to thrive, grows well in late summer. Good forage potential in areas with sufficient heat. Large N fixation potential. Interesting yellow blooms. Low weed risk, but with enough time can set viable seed. Becomes stemmy as it matures. Inoculate seed; cross-inoculates with cowpea. Spindly growth habit with narrow leaves seems to make it a better choice for mixes than monoculture. Mix with sorghum-sudangrass, pearl millet, sunflower."
  },
  "Triticale, Winter": {
    "Topic Details": "A cross between rye and wheat, with characteristics intermediate between the two. High biomass yield potential is similar to wheat and rye. Matures later than rye, a little later than wheat. Plant height at heading is shorter than rye. Therefore, spring residue is easier to manage than rye and (assuming same kill date) C:N ratio will be slightly lower than rye. Triticale feed quality is generally better than rye, but not as good as wheat (i.e. chop triticale for silage at boot stage). Spring triticale varieties do not require vernalization (overwintering) to flower and may be less cold hardy than winter triticale varieties if planted in the fall."
  },
  "Vetch, Hairy": {
    "Topic Details": "Vining cool-season annual. Reliable and widely used. Very winter-hardy. Little fall growth, but fast, vining spring growth makes it excellent for N fixation, biomass. Residues release N fast. Good forage. Host to some problem nematodes. Avoided by some (especially small-grain producers) due to weed concerns. Up to 20% of seed is hard, will germinate in future as a weed. Hard seed risk can be nullified by scarifying seed. Can wrap up in equipment. Mixes especially well with rye; climbs small grain in mixes. Inoculate the seed with appropriate Rhizobium spp.; cross inoculates peas."
  },
  "Wheat, Winter": {
    "Topic Details": "Common cover crop. Needs vernalization (overwintering) to flower. Not likely to produce seed and will stay shorter if planted in spring. Very good N scavenger. Excellent quality forage. After well-timed grazings can still produce spring biomass or grain. Not for small grain cash crop rotations (host for same diseases and pests). Fine nurse crop for legumes. Mixes well with winter peas, hairy vetch. Shorter, slower to head means residue easier to manage than rye. Planted later in fall, matures later in spring, tolerates wetness better (but not flooding), higher spring biomass potential (but requires high fertility) than barley."
  }
}
